app/Controllers/PlanesController.php

    public function index(): string
    {
        $planes = new PlanesModel();
        $datos['datos']=$planes->findAll();
---
SELECT *
FROM `planes`